doc/uml/dot/vccycle-relations.dot
digraph "classes" {
rankdir=BT
charset="utf-8"
"vcc.VCCycle" [
       color="black", fontcolor="black", 
      label="{VCCycle|
          \l|
       \l}", shape="record", style="solid"];

"vcc.vcc.vcc.connector.Connector" [color="black", fontcolor="black",
                       label="{Connector| 
                        \l|
                        \l}",
                        shape="record", style="solid"];

"components.port.Port" [color="black", fontcoor="black",
         label="{Port|
                    \l|
                  \l}", shape="record", style="solid"];

"components.compressor.Compressor" [color="black", fontcoor="black",
         label="{Compressor|
                    \l|
                  \l}", shape="record", style="solid"];
"components.condenser.Condenser" [color="black", fontcolor="black", 
    label="{Condenser|
                   \l|
                  \l}", shape="record", style="solid"];
"components.evaporator.Evaporator" [color="black", fontcolor="black", 
  label="{Evaporator| 
                   \l|
                  \l}", shape="record", style="solid"];
"components.expansionvalve.ExpansionValve" [color="black", fontcolor="black", 
label="{ExpansionValve|
                   \l|
                  \l}", shape="record", style="solid"];

"vcc.vcc.vcc.connector.Connector"->"vcc.VCCycle"[
            arrowhead="diamond", arrowtail="none",
            fontcolor="blue",
            label="1", style="solid"]

"components.compressor.Compressor"->"vcc.VCCycle"[
            arrowhead="odiamond", arrowtail="none",
            fontcolor="blue",
            label="1..*", style="solid"]
"components.condenser.Condenser"->"vcc.VCCycle"[
            arrowhead="odiamond", arrowtail="none",
            fontcolor="blue",
            label="1..*", style="solid"]
"components.evaporator.Evaporator"->"vcc.VCCycle"[
            arrowhead="odiamond", arrowtail="none",
            fontcolor="blue",
            label="1..*", style="solid"]
"components.expansionvalve.ExpansionValve"->"vcc.VCCycle"[
            arrowhead="odiamond", arrowtail="none",
            fontcolor="blue",
            label="1..*", style="solid"]


"components.port.Port"->"components.expansionvalve.ExpansionValve"[
            arrowhead="diamond", arrowtail="none",
            fontcolor="blue",
            label="2", style="solid"]
"components.port.Port"->"components.evaporator.Evaporator"[
            arrowhead="diamond", arrowtail="none",
            fontcolor="blue",
            label="2", style="solid"]
"components.port.Port"->"components.condenser.Condenser"[
            arrowhead="diamond", arrowtail="none",
            fontcolor="blue",
            label="2", style="solid"]
"components.port.Port"->"components.compressor.Compressor"[
            arrowhead="diamond", arrowtail="none",
            fontcolor="blue",
            label="2", style="solid"]
"components.port.Port"->"vcc.vcc.vcc.connector.Connector"[
            arrowhead="diamond", arrowtail="none",
            fontcolor="blue",
            label="2..*", style="solid"]
}
